moc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-11 Thu 19:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>moc</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/darksun.css"/>
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">moc
<br />
<span class="subtitle">Model Oriented Configuration</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#overview">Overview</a></li>
<li><a href="#dive-in">Dive in</a></li>
<li><a href="#technical-design">Technical design</a>
<ul>
<li><a href="#stream-frame-message">Streams, frames and messages</a></li>
<li><a href="#message-types">Reserved message types</a></li>
<li><a href="#byte-stream-formats">Byte stream formats</a></li>
<li><a href="#schema">Schema</a></li>
<li><a href="#example-schema">Example schema</a></li>
<li><a href="#payload-schema">Payload schema</a></li>
<li><a href="#intra-message">Intra-message Schema</a></li>
<li><a href="#inter-message">Inter-message schema</a></li>
</ul>
</li>
<li><a href="#orgad45330">Package layout</a></li>
<li><a href="#org63b6a2f">Extensions</a></li>
<li><a href="#org815dfb1">Blah blah</a></li>
<li><a href="#org3e5fadd">mock up</a></li>
<li><a href="#org4c7bca8">Configuration store</a></li>
</ul>
</div>
</div>


<div id="outline-container-overview" class="outline-2">
<h2 id="overview">Overview</h2>
<div class="outline-text-2" id="text-overview">
<p>
moc is a moo for a <i>configuration</i> system.  It provides::
</p>

<ul class="org-ul">
<li>a vocabulary for defining the <i>schema</i> that configuration information should follow.</li>

<li>tooling to validate configuration objects against their schema.</li>

<li>code generators creating native language (C++/Python) types and serialization methods between those types and configuration objects.</li>

<li>native language libraries and shell programs for producing and consuming configuration in a variety of <i>formats</i> and media including files and <i>streams</i>.</li>

<li>a demo application and configuration.</li>
</ul>
</div>
</div>

<div id="outline-container-dive-in" class="outline-2">
<h2 id="dive-in">Dive in</h2>
<div class="outline-text-2" id="text-dive-in">
<p>
moc is currently not production but rather provides a mock up demo.
To use it, first install the <code>moo</code> Python package eg like:
</p>

<pre class="example">
$ echo layout python3 &gt; .envrc
$ direnv allow
</pre>

<p>
Or, if you don't have <code>direnv</code>
</p>

<pre class="example">
$ python3 -m venv venv
$ source venv/bin/activiate
</pre>

<p>
Then install <code>moo</code>
</p>

<pre class="example">
$ pip install -e .
$ moo --help
</pre>

<p>
The moc demo is in <a href="moc/">moc/</a>:
</p>

<pre class="example">
$ cd moc
$ make
</pre>
</div>
</div>


<div id="outline-container-technical-design" class="outline-2">
<h2 id="technical-design">Technical design</h2>
<div class="outline-text-2" id="text-technical-design">
<p>
moc is a <b>moo</b> focused on generating configuration objects and various means to deliver them into an application.  This section describes aspects of the technical design.
</p>
</div>

<div id="outline-container-stream-frame-message" class="outline-3">
<h3 id="stream-frame-message">Streams, frames and messages</h3>
<div class="outline-text-3" id="text-stream-frame-message">
<p>
moc configuration data follows an abstract low level format which may be realized in a few ways and independently from the concrete high level schema of the delivered content.  This provides flexibility to an application to select how configuration information is delivered  
</p>

<p>
The abstract low level format is defined in terms of <b>streams</b> of <b>bytes</b>, <b>frames</b> and <b>messages</b> as described:
</p>

<dl class="org-dl">
<dt>bytes</dt><dd>A <b>moc byte stream</b> consists of a sequence of 8 bit bytes.  Several types of byte streams are supported by moc including commonly known ones (eg, a JSON object or a <a href="https://en.wikipedia.org/wiki/JSON_streaming">JSON stream</a> and ones suitable for message passing systems like ZeroMQ).  Some byte streams may place limits the format of information they carry (eg, a JSON Stream may be used only for JSON text).</dd>

<dt>frames</dt><dd>A <b>moc frame stream</b> consists of a logical sequence of frames derived from a bytes stream.  A frame is a contiguous and finite sequence of bytes which may be read into memory in an atomic manner.  If two byte streams support the format of a frame then they both shall decode an identical frame identically.</dd>

<dt>messages</dt><dd>A <b>moc message stream</b> consists of a logical sequence of messages derived from a frame stream.  The application may determine the extent and interpretation of the message by progressively examining the frames.  moc messages must have an initial frame, called the message type <b>hint</b> which must consist of only printable ASCII characters suitable for use in forming a C symbol.  moc reserves a number of hint values, listed in the table below which are to be used to identify the low-level format of the next and last frame in the message called the <b>payload</b>.  The application is free to extend the list of message type hints it supports.</dd>

<dt>types</dt><dd>A <b>moc type stream</b> produces a stream of objects in native language type.  It serializes messages from a moc message stream.  When used, the application must know the type expected.</dd>
</dl>
</div>
</div>

<div id="outline-container-message-types" class="outline-3">
<h3 id="message-types">Reserved message types</h3>
<div class="outline-text-3" id="text-message-types">
<p>
The set of reserved moc message type hints are:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">hint</th>
<th scope="col" class="org-left">payload encoding</th>
<th scope="col" class="org-left">C++</th>
<th scope="col" class="org-left">Python</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">JSON</td>
<td class="org-left">JSON string</td>
<td class="org-left">yes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">BSON</td>
<td class="org-left">Binary JSON</td>
<td class="org-left">yes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CBOR</td>
<td class="org-left">Binary JSON</td>
<td class="org-left">yes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">UBJS</td>
<td class="org-left">Binary JSON</td>
<td class="org-left">yes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MSGP</td>
<td class="org-left">Message Pack</td>
<td class="org-left">yes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">JSNT</td>
<td class="org-left">Jsonnet string</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">AVRJ</td>
<td class="org-left">Avro JSON</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">AVRB</td>
<td class="org-left">Avro binary</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PBUF</td>
<td class="org-left">Protobuf</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-byte-stream-formats" class="outline-3">
<h3 id="byte-stream-formats">Byte stream formats</h3>
<div class="outline-text-3" id="text-byte-stream-formats">
<p>
moc provides byte stream decoding for a few common types:
</p>

<dl class="org-dl">
<dt>JSON</dt><dd>the bytes stream is assumed to be a <a href="https://en.wikipedia.org/wiki/JSON_streaming">JSON stream</a>.  As it may only hold JSON format data the moc message type hint is implicitly and always <code>JSON</code>.  The stream may consist of an admixed concatenation of JSON types.  The first frame from a JSON byte stream is the string <code>JSON</code> which is implicitly generated.  The second frame will contain the JSON text of the first JSON type in the stream.  This then repeats until the stream is exhausted.</dd>

<dt>SHFM</dt><dd>a "size-hinted framed message" may hold arbitrary data (binary and text, including JSON) and is well suited for use with ZeroMQ or other message passing systems.  In the byte stream, a frame is prefixed with a binary value holding the size of the frame data measured in bytes.  If less than 255 the size value is stored in a single byte.  If the size is 255 or greater but less than 2<sup>32</sup>-1 the first byte is 255 (<code>0xff</code>) and the next four bytes hold the size as a 32 bit integer.  The first frame in a message shall provide the message type hint and for hints reserved by moc, the subsequent and only other frame in the message holds the payload frame of that type.  An example SHFM message is shown next with a frame depicted as <code>[size|body]</code> where the <code>size</code> in a binary value and the <code>body</code> is expressed in ASCII:</dd>
</dl>

<pre class="example">
[4|JSON][8|{"a":42}]
</pre>
</div>
</div>
