moc.org
** Schema
   :PROPERTIES:
   :CUSTOM_ID: schema
   :END:


The producer and consumer of a moc *message stream* must honor a shared *contract* (or *schema*) which governs the structure of the data.  A particular schema may span one of these possible levels of context:

- payload :: the structure of a given payload frame body.  
- intra message :: the structure of payload frames in a message.  
- inter message :: the structure of messages in a stream

moc provides a means to rigorously define schema as a (meta) data structure and with two goals in mind for the use of a schema:

- validation :: a schema may be used to check if a given data object (aka *model*) obeys the contract defined by the schema.
- generation :: a schema object may be applied to a *template* in order to generate a *representation*.

These two goals require different data structure.  For example, a validation schema is well represented as a data structure which itself obeys the JSON Schema while a generation schema is better represented by a data structure which itself obeys the Avro Schema.  

To avoid developing two conceptually identical schema structures to satisfy these two forms, moc provides support for a developer to define a schema abstractly in the form of Jsonnet function calls.  These functions are parameterized on a Jsonnet object holding primitive schema defining functions.  This allows the same developer-provided functions to be called with JSON Schema primitives or with Avro Schema primitives and output the proper structure for each.

** Example schema
   :PROPERTIES:
   :CUSTOM_ID: example-schema
   :END:


A simple example makes this clear.  As described above, moc reserves a set of message type hints.  We may define schema for this simple frame like:

#+include: moc/simple.jsonnet src jsonnet

With the above, ~moo~ can validate that ~data~ is correct against ~jscm~:

#+begin_src shell :exports both :results output code :wrap "example"
moo validate -s moc/simple.jsonnet -S jscm -D data moc/simple.jsonnet
#+end_src

#+RESULTS:
#+begin_example
null
#+end_example

The null means no error.

We may use ~moo~ to compile the ~avro~ structure to an Avro schema JSON file and generate code:

#+begin_src shell :exports both :results output code :wrap "src c++"
moo compile -P avro moc/simple.jsonnet > simple.json
avrogencpp -n moc -i simple.json -o simple_avro.hpp
grep -m1 -A10 Hint: simple_avro.hpp
#+end_src

#+RESULTS:
#+begin_src c++
enum class Hint: unsigned {
    JSON,
    BSON,
    CBOR,
    UBJS,
    MSGP,
    JSNT,
    AVRJ,
    AVRB,
    PBUF,
};
#+end_src

In that header is more generated code to serialize this ~enum~ via the Avro codec.  moc may provide methods to transparently select that codec based on the "hint" being ~AVRJ~ or ~AVRB~.

moc also supports ~nlohmann::json~ family of codecs to support the remaining hints besides ~PBUF~.  With a suitable template file and the info supplied in the model by the ~tmpl~ attribute, ~moo~ can generate the needed code like:

#+begin_src shell :exports both :results output code :wrap "src c++"
moo render -P tmpl moc/simple.jsonnet moc/avro_nljs.hpp.j2 > simple_nljs.hpp
grep -m1 -A10 ENUM simple_nljs.hpp
#+end_src

#+RESULTS:
#+begin_src c++
    NLOHMANN_JSON_SERIALIZE_ENUM( Hint, {
            { moc::Hint::JSON, "JSON" },
            { moc::Hint::BSON, "BSON" },
            { moc::Hint::CBOR, "CBOR" },
            { moc::Hint::UBJS, "UBJS" },
            { moc::Hint::MSGP, "MSGP" },
            { moc::Hint::JSNT, "JSNT" },
            { moc::Hint::AVRJ, "AVRJ" },
            { moc::Hint::AVRB, "AVRB" },
            { moc::Hint::PBUF, "PBUF" },
        })
#+end_src

Where this snippet shows how we ultimately rely on a CPP macro provided by ~nlohmann~ to generate codec.  This produces ~to_json()~ and ~from_json()~ type functions.

** Payload schema
   :PROPERTIES:
   :CUSTOM_ID: payload-schema
   :END:


The simple example above may be considered also an example of a trivial payload body schema.  However, a payload schema will typically be rather more complex.  It will be built from various primitive schema types as well as built up further upon types it defines itself.  For example, consider a schema describing the simple object example from [[https://github.com/nlohmann/json/#arbitrary-types-conversions][nlohmann::json]] documentation:

#+include: moc/person.jsonnet src jsonnet

The fundamental types provided by moo are an amalgamation of those named by Avro and JSON Schema: ~boolean~, ~string~, ~number~, ~array~ of a type and ~record~ aggregating a number of ~field~ elements, each of a type.  

