moc.html

<div id="outline-container-schema" class="outline-3">
<h3 id="schema">Schema</h3>
<div class="outline-text-3" id="text-schema">
<p>
The producer and consumer of a moc <b>message stream</b> must honor a shared <b>contract</b> (or <b>schema</b>) which governs the structure of the data.  A particular schema may span one of these possible levels of context:
</p>

<dl class="org-dl">
<dt>payload</dt><dd>the structure of a given payload frame body.</dd>
<dt>intra message</dt><dd>the structure of payload frames in a message.</dd>
<dt>inter message</dt><dd>the structure of messages in a stream</dd>
</dl>

<p>
moc provides a means to rigorously define schema as a (meta) data structure and with two goals in mind for the use of a schema:
</p>

<dl class="org-dl">
<dt>validation</dt><dd>a schema may be used to check if a given data object (aka <b>model</b>) obeys the contract defined by the schema.</dd>
<dt>generation</dt><dd>a schema object may be applied to a <b>template</b> in order to generate a <b>representation</b>.</dd>
</dl>

<p>
These two goals require different data structure.  For example, a validation schema is well represented as a data structure which itself obeys the JSON Schema while a generation schema is better represented by a data structure which itself obeys the Avro Schema.  
</p>

<p>
To avoid developing two conceptually identical schema structures to satisfy these two forms, moc provides support for a developer to define a schema abstractly in the form of Jsonnet function calls.  These functions are parameterized on a Jsonnet object holding primitive schema defining functions.  This allows the same developer-provided functions to be called with JSON Schema primitives or with Avro Schema primitives and output the proper structure for each.
</p>
</div>
</div>

<div id="outline-container-example-schema" class="outline-3">
<h3 id="example-schema">Example schema</h3>
<div class="outline-text-3" id="text-example-schema">
<p>
A simple example makes this clear.  As described above, moc reserves a set of message type hints.  We may define schema for this simple frame like:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #73d216;">// access schema primitive functions</span>
<span style="color: #b4fa70;">local</span> moc = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moc.jsonnet"</span>;
{
    schema(s):: {
        hint: s.enum(<span style="color: #e9b96e;">"Hint"</span>, [<span style="color: #e9b96e;">"JSON"</span>,<span style="color: #e9b96e;">"BSON"</span>,<span style="color: #e9b96e;">"CBOR"</span>,<span style="color: #e9b96e;">"UBJS"</span>,<span style="color: #e9b96e;">"MSGP"</span>,
                              <span style="color: #e9b96e;">"JSNT"</span>,<span style="color: #e9b96e;">"AVRJ"</span>,<span style="color: #e9b96e;">"AVRB"</span>,<span style="color: #e9b96e;">"PBUF"</span>]),
    },

    base: <span style="color: #b4fa70;">self</span>.schema(moc.base).hint,
    avro: <span style="color: #b4fa70;">self</span>.schema(moc.avro).hint,
    jscm: <span style="color: #b4fa70;">self</span>.schema(moc.jscm).hint,
    tmpl: {
        namespace: <span style="color: #e9b96e;">"moc"</span>,
        types: [ $.avro ],
    },

    data: <span style="color: #e9b96e;">"JSON"</span>,

}
</pre>
</div>

<p>
With the above, <code>moo</code> can validate that <code>data</code> is correct against <code>jscm</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell">moo validate -s moc/simple.jsonnet -S jscm -D data moc/simple.jsonnet
</pre>
</div>

<pre class="example">
null
</pre>

<p>
The null means no error.
</p>

<p>
We may use <code>moo</code> to compile the <code>avro</code> structure to an Avro schema JSON file and generate code:
</p>

<div class="org-src-container">
<pre class="src src-shell">moo compile -P avro moc/simple.jsonnet &gt; simple.json
avrogencpp -n moc -i simple.json -o simple_avro.hpp
grep -m1 -A10 Hint: simple_avro.hpp
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c++">
</pre>
</div>

<p>
In that header is more generated code to serialize this <code>enum</code> via the Avro codec.  moc may provide methods to transparently select that codec based on the "hint" being <code>AVRJ</code> or <code>AVRB</code>.
</p>

<p>
moc also supports <code>nlohmann::json</code> family of codecs to support the remaining hints besides <code>PBUF</code>.  With a suitable template file and the info supplied in the model by the <code>tmpl</code> attribute, <code>moo</code> can generate the needed code like:
</p>

<div class="org-src-container">
<pre class="src src-shell">moo render -P tmpl moc/simple.jsonnet moc/avro_nljs.hpp.j2 &gt; simple_nljs.hpp
grep -m1 -A10 ENUM simple_nljs.hpp
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c++">NLOHMANN_JSON_SERIALIZE_ENUM( Hint, {
        { <span style="color: #e9b2e3;">moc</span>::<span style="color: #e9b2e3;">Hint</span>::JSON, <span style="color: #e9b96e;">"JSON"</span> },
        { <span style="color: #e9b2e3;">moc</span>::<span style="color: #e9b2e3;">Hint</span>::BSON, <span style="color: #e9b96e;">"BSON"</span> },
        { <span style="color: #e9b2e3;">moc</span>::<span style="color: #e9b2e3;">Hint</span>::CBOR, <span style="color: #e9b96e;">"CBOR"</span> },
        { <span style="color: #e9b2e3;">moc</span>::<span style="color: #e9b2e3;">Hint</span>::UBJS, <span style="color: #e9b96e;">"UBJS"</span> },
        { <span style="color: #e9b2e3;">moc</span>::<span style="color: #e9b2e3;">Hint</span>::MSGP, <span style="color: #e9b96e;">"MSGP"</span> },
        { <span style="color: #e9b2e3;">moc</span>::<span style="color: #e9b2e3;">Hint</span>::JSNT, <span style="color: #e9b96e;">"JSNT"</span> },
        { <span style="color: #e9b2e3;">moc</span>::<span style="color: #e9b2e3;">Hint</span>::AVRJ, <span style="color: #e9b96e;">"AVRJ"</span> },
        { <span style="color: #e9b2e3;">moc</span>::<span style="color: #e9b2e3;">Hint</span>::AVRB, <span style="color: #e9b96e;">"AVRB"</span> },
        { <span style="color: #e9b2e3;">moc</span>::<span style="color: #e9b2e3;">Hint</span>::PBUF, <span style="color: #e9b96e;">"PBUF"</span> },
    })
</pre>
</div>

<p>
Where this snippet shows how we ultimately rely on a CPP macro provided by <code>nlohmann</code> to generate codec.  This produces <code>to_json()</code> and <code>from_json()</code> type functions.
</p>
</div>
</div>

<div id="outline-container-payload-schema" class="outline-3">
<h3 id="payload-schema">Payload schema</h3>
<div class="outline-text-3" id="text-payload-schema">
<p>
The simple example above may be considered also an example of a trivial payload body schema.  However, a payload schema will typically be rather more complex.  It will be built from various primitive schema types as well as built up further upon types it defines itself.  For example, consider a schema describing the simple object example from <a href="https://github.com/nlohmann/json/#arbitrary-types-conversions">nlohmann::json</a> documentation:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #b4fa70;">local</span> moc = <span style="color: #b4fa70;">import</span> <span style="color: #e9b96e;">"moc.jsonnet"</span>;

{
    schema(s) :: {
        <span style="color: #b4fa70;">local</span> name = s.string(pattern=<span style="color: #e9b96e;">'^[a-zA-Z ]$'</span>),
        <span style="color: #b4fa70;">local</span> address = s.string(pattern=<span style="color: #e9b96e;">'^[a-zA-Z0-9 ]$'</span>),
        <span style="color: #b4fa70;">local</span> age = s.number(<span style="color: #e9b96e;">"i4"</span>, {minimum:0}),
        <span style="color: #b4fa70;">local</span> person = s.record(<span style="color: #e9b96e;">"Person"</span>, [
            s.field(<span style="color: #e9b96e;">"name"</span>, name),
            s.field(<span style="color: #e9b96e;">"address"</span>, address),
            s.field(<span style="color: #e9b96e;">"age"</span>, age)
        ]),
        ret: person,
    }.ret,

    base: <span style="color: #b4fa70;">self</span>.schema(moc.base),
