moc.org
** Intra-message Schema
   :PROPERTIES:
   :CUSTOM_ID: intra-message
   :END:


The message type hints reserved by moc also specify exactly one message payload frame may follow.  The intra-message schema for these types is thus specified.

Application developers are free to extend the supported hints to include message types with multiple payload frames.  They may develop schema to describe the message as a hole in terms of an array of schema.  

For example, an application may prefer define a "PEOPLE" message type which puts in each frame a ~person~ record as described in the example above.  An intra-message schema may then be defined as the ~people~ schema.  What is required in the Jsonnet is to expose more of the internal schema structure for example as:

#+begin_src jsonnet
  // as above
  {
      schema(s):: {
          // [...as above omitted...]
          // person
          people: s.array(self.person),
      }
      jscm: self.schema(j.schema).people,
      avro: self.schema(a.schema).people,
  }
#+end_src

Note we comment out the "return value" ~person~ and instead use its local definition as a type to define the returned ~people~.

The same document may produce JSON Schema and Avro schema for all abstract schema:

#+begin_src jsonnet
  {
      schema(s) :: {
          // locals as above but return object of:
          person: person,
          people: people,
      }
      jscm: self.schema(j.schema),
      avro: self.schema(a.schema),
  }
#+end_src

When applying either of the produced schema one has to take into account the substructure.  Eg, ~avro.person~ would be used to generate a ~Person~ object.

** Inter-message schema
   :PROPERTIES:
   :CUSTOM_ID: inter-message
   :END:

Inter-message schema may be (under) specified simply as an array of expected hints.   Or the same patterns described above may be extended to cover multiple messages as they are shown to cover multiple frames.  In other words, it may be schema all the way down.  

* Package layout


* Extensions

- new hints to allow different payload format or 0 or more than one payload frames
- intra-message schema when multiple payloads are allowed.  this can likely mimic inter-message schema


* Blah blah


The working demonstration is a distributed system which decomposes into 

- a single, general software /application/ (something with a ~main()~) which aggregates

- a set of software /components/ that are provided in

- dynamically loaded plugin shared libraries resulting in a number of

- running /process/ instances 

The application is general and has these explicit parts:

- command line parsing 
- load any plugins named on the CLI
- instantiate a moc entry point component based on CLI arguments
- execute moc entry point to receive application configuration
- load additional plugins as per cfg
- instantiate components as per cfg
- apply component cfg on instances
- execute instances

This demo is a one-shot configuration, there is no re-config mechanism.  This may be developed as an extension.

moc configuration information may exist in serialized /message/ form and in a native language (C++/python) fully typed class.  The code providing /deserializing/ methods is generated based on a moo schema defining the configuration structure.  Generated code is compiled into headers and source which the application and components may be developed against.






