moc.html
    avro: <span style="color: #b4fa70;">self</span>.schema(moc.avro),
    jscm: <span style="color: #b4fa70;">self</span>.schema(moc.jscm),


}
</pre>
</div>

<p>
The fundamental types provided by moo are an amalgamation of those named by Avro and JSON Schema: <code>boolean</code>, <code>string</code>, <code>number</code>, <code>array</code> of a type and <code>record</code> aggregating a number of <code>field</code> elements, each of a type.  
</p>
</div>
</div>

<div id="outline-container-intra-message" class="outline-3">
<h3 id="intra-message">Intra-message Schema</h3>
<div class="outline-text-3" id="text-intra-message">
<p>
The message type hints reserved by moc also specify exactly one message payload frame may follow.  The intra-message schema for these types is thus specified.
</p>

<p>
Application developers are free to extend the supported hints to include message types with multiple payload frames.  They may develop schema to describe the message as a hole in terms of an array of schema.  
</p>

<p>
For example, an application may prefer define a "PEOPLE" message type which puts in each frame a <code>person</code> record as described in the example above.  An intra-message schema may then be defined as the <code>people</code> schema.  What is required in the Jsonnet is to expose more of the internal schema structure for example as:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet"><span style="color: #73d216;">// as above</span>
{
    schema(s):: {
        <span style="color: #73d216;">// [...as above omitted...]</span>
        <span style="color: #73d216;">// person</span>
        people: s.array(<span style="color: #b4fa70;">self</span>.person),
    }
    jscm: <span style="color: #b4fa70;">self</span>.schema(j.schema).people,
    avro: <span style="color: #b4fa70;">self</span>.schema(a.schema).people,
}
</pre>
</div>

<p>
Note we comment out the "return value" <code>person</code> and instead use its local definition as a type to define the returned <code>people</code>.
</p>

<p>
The same document may produce JSON Schema and Avro schema for all abstract schema:
</p>

<div class="org-src-container">
<pre class="src src-jsonnet">{
    schema(s) :: {
        <span style="color: #73d216;">// locals as above but return object of:</span>
        person: person,
        people: people,
    }
    jscm: <span style="color: #b4fa70;">self</span>.schema(j.schema),
    avro: <span style="color: #b4fa70;">self</span>.schema(a.schema),
}
</pre>
</div>

<p>
When applying either of the produced schema one has to take into account the substructure.  Eg, <code>avro.person</code> would be used to generate a <code>Person</code> object.
</p>
</div>
</div>

<div id="outline-container-inter-message" class="outline-3">
<h3 id="inter-message">Inter-message schema</h3>
<div class="outline-text-3" id="text-inter-message">
<p>
Inter-message schema may be (under) specified simply as an array of expected hints.   Or the same patterns described above may be extended to cover multiple messages as they are shown to cover multiple frames.  In other words, it may be schema all the way down.  
</p>
</div>
</div>
</div>

<div id="outline-container-orgad45330" class="outline-2">
<h2 id="orgad45330">Package layout</h2>
</div>


<div id="outline-container-org63b6a2f" class="outline-2">
<h2 id="org63b6a2f">Extensions</h2>
<div class="outline-text-2" id="text-org63b6a2f">
<ul class="org-ul">
<li>new hints to allow different payload format or 0 or more than one payload frames</li>
<li>intra-message schema when multiple payloads are allowed.  this can likely mimic inter-message schema</li>
</ul>
</div>
</div>


<div id="outline-container-org815dfb1" class="outline-2">
<h2 id="org815dfb1">Blah blah</h2>
<div class="outline-text-2" id="text-org815dfb1">
<p>
The working demonstration is a distributed system which decomposes into 
</p>

<ul class="org-ul">
<li>a single, general software <i>application</i> (something with a <code>main()</code>) which aggregates</li>

<li>a set of software <i>components</i> that are provided in</li>

<li>dynamically loaded plugin shared libraries resulting in a number of</li>

<li>running <i>process</i> instances</li>
</ul>

<p>
The application is general and has these explicit parts:
</p>

<ul class="org-ul">
<li>command line parsing</li>
<li>load any plugins named on the CLI</li>
<li>instantiate a moc entry point component based on CLI arguments</li>
<li>execute moc entry point to receive application configuration</li>
<li>load additional plugins as per cfg</li>
<li>instantiate components as per cfg</li>
<li>apply component cfg on instances</li>
<li>execute instances</li>
</ul>

<p>
This demo is a one-shot configuration, there is no re-config mechanism.  This may be developed as an extension.
</p>

<p>
moc configuration information may exist in serialized <i>message</i> form and in a native language (C++/python) fully typed class.  The code providing <i>deserializing</i> methods is generated based on a moo schema defining the configuration structure.  Generated code is compiled into headers and source which the application and components may be developed against.
</p>
</div>
</div>
