moc.html






<div id="outline-container-org3e5fadd" class="outline-2">
<h2 id="org3e5fadd">mock up</h2>
<div class="outline-text-2" id="text-org3e5fadd">
<p>
Want:
</p>

<ul class="org-ul">
<li>define rules for validating structure expressed in JSON</li>
<li>map a structure composed values in JSON types to C++/Python class definitions</li>
<li>generate code to serialize values to C++/Python instances</li>
<li>allow for partial serializing in order to delegate serializing.</li>
</ul>

<p>
Want to construct a node, eg inside <code>main()</code> or maybe inside some main <code>Application</code> object:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">This mock up will create and configure an instance of "Node" which</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">whill create, configure and aggregate instances of "Port" and</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">"Comp" (component) each of which uses some subset of the ports.</span>

<span style="color: #73d216;">// </span><span style="color: #73d216;">The process is driven by a particular configuration istream.  The</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">program may have different types of config streams and which used</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">is determined by a meta configuration such as provided on the</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">command line.  The CfgStreamKey categorizes the type and any</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">additional information needed to instantiate or access a config</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">stream.</span>
<span style="color: #8cc4ff;">CfgStreamKey</span> <span style="color: #fcaf3e;">cfg_stream_info</span> = parse_cli_arg_for_cfg_stream_info();

<span style="color: #73d216;">// </span><span style="color: #73d216;">Resolve the key a CfgStream object.  A CfgStream provides a</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">sequence interface.  Maybe like std::istream, std::queue, or ZeroMQ</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">socket.</span>
<span style="color: #8cc4ff;">CfgStream</span>&amp; <span style="color: #fcaf3e;">cfgstream</span> = get_cfgstream(cfg_stream_info); 

<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;Node&gt; <span style="color: #fcaf3e;">nodes</span>;
<span style="color: #b4fa70;">while</span> (!cfgstream.empty()) {
    nodes.emplace_back(cfgstream);
}
</pre>
</div>

<p>
Inside the <code>Node</code> constructor we process the configuration stream to make ports and node components.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #73d216;">// </span><span style="color: #73d216;">We assume the stream follows a protocol.  The stream is to consist</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">of distinct frames and frames are grouped into messages.  A frame</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">is read into application memory in an atomic manner.  The number of</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">frames in a message the the interpretation of each frame may depend</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">on previous frames in the message.</span>

<span style="color: #73d216;">// </span><span style="color: #73d216;">We assume a message has an initial frame consisting of a string</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">which gives the format to assume for the second frame.  Eg,</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">["JSON",&lt;JSON text&gt;].  We hide this interpretation and return a C++</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">class that the Node constructor code knows.  More on this constructor</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">later.</span>
<span style="color: #8cc4ff;">NodeCfg</span> <span style="color: #fce94f;">nodecfg</span>(cfgstream);

cout &lt;&lt; <span style="color: #e9b96e;">"Loading node ID: "</span> &lt;&lt; nodecfg.ident() &lt;&lt; <span style="color: #e9b96e;">"\n"</span>;

<span style="color: #73d216;">// </span><span style="color: #73d216;">A node instantiates, configures and aggregates ports.  Here, a port</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">is assumed to be some socket with a "smart" constuction driven by</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">the configuration.  Eg, it may perform auto discovery of peers.</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">But, in this mock up it also represents any type of shared objects</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">or resources that need to be constructed outside the components.</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">Note: in this mockup, configuration supersedes ports.  We may want</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">to have configuratoin delivered via a port in which case these</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">patterns need to be largely refactored.  One way would be to allow</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">a component to be a node.  Then use a top node constructed a local</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">cfgstream to construct a component node that listens on a port to</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">produce a configuration stream that generates one or more new nodes.</span>
<span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;Port&gt; <span style="color: #fcaf3e;">ports</span>;
<span style="color: #b4fa70;">for</span> (<span style="color: #8cc4ff;">PortCfg</span> <span style="color: #fcaf3e;">portcfg</span>: nodecfg.portdefs()) {
    ports.emplace_back(portcfg);
}
go_online(ports);

<span style="color: #73d216;">// </span><span style="color: #73d216;">We may need to use ports outside the constructor and at least</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">should keep them alive.</span>
m_ports = ports;

<span style="color: #73d216;">// </span><span style="color: #73d216;">The Node constructor only cares about configuring any components</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">and does so through a factory method which returns a component as</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">an abtrace IConfigurable facet.  We assume the factory holds on to</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">the instance.</span>
<span style="color: #b4fa70;">for</span> (<span style="color: #8cc4ff;">CompCfg</span> <span style="color: #fcaf3e;">compcfg</span> : nodecfg.compdefs()) {
    <span style="color: #73d216;">// </span><span style="color: #73d216;">Get type name and instance identifier</span>
    <span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">tn</span> = compcfg.type_name();
    <span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">id</span> = compcfg.ident();
    <span style="color: #b4fa70;">auto</span>&amp; <span style="color: #fcaf3e;">comp</span> = factory.get&lt;IComponent&gt;(tn, id);
    <span style="color: #73d216;">// </span><span style="color: #73d216;">Some components need ports, but the node creates them so the</span>
    <span style="color: #73d216;">// </span><span style="color: #73d216;">component says which ones they want by name (ident).</span>
    <span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">ports</span> = get_ports(compcfg.ports());
    comp-&gt;configure(id, cfgstream, ports);
}

<span style="color: #73d216;">// </span><span style="color: #73d216;">This mockup is about configuration patterns so it omits other</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">possible Node-level configuration items.  As a placeholder we imply</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">that by saving the NodeCfg for use in other Node methods.</span>
m_cfg = nodecfg;

<span style="color: #73d216;">// </span><span style="color: #73d216;">But, suggest one possible additional configuration processing: Not</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">all components are necessarily configurable and thus the node is</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">given a possible superset which lists all components that are</span>
<span style="color: #73d216;">// </span><span style="color: #73d216;">runable.</span>
<span style="color: #b4fa70;">for</span> (<span style="color: #b4fa70;">auto</span> <span style="color: #fcaf3e;">torun</span> : compcfg.runnables()) {
    m_runables.push_back(factor.get&lt;IRunnable&gt;(torun));
}
<span style="color: #73d216;">// </span><span style="color: #73d216;">later in a Node::run() we may forward the call to components.</span>
</pre>
</div>


<p>
We create
</p>

<ul class="org-ul">
<li>a configuration object (cfgobj) in JSON</li>
<li>a validation object (valobj) in JSON Schema vocabulary to validate a cfgobj</li>
<li>a definition structure (defobj) in Avro Schema to produce C++ or Python types</li>
</ul>

<p>
Processing
</p>

<ul class="org-ul">
<li>a defobj is created as JSON</li>
<li>Avro generate is run to produce C++ or Python</li>
<li>a cfgobj is created as JSON</li>
<li></li>
</ul>
</div>
</div>
