moc.org
* Configuration store

We want:

- to construct an application out of components dynamically driven by configuration information. 
- Provide configuration in a way that can be progressively consumed and applied 
- Allow for multiple sources of config, including files and messages.
- Provide serialization to native types.
- Do not tightly couple configuration and interpretation

The stream introduced above breaks that last one.  Eg configuration
frames in the stream must be ordered to match how the code tries to
apply.  In the example, depth-first ordering is required.  This is
however a natural order for eg JSON.


 
