moc.html

<div id="outline-container-org4c7bca8" class="outline-2">
<h2 id="org4c7bca8">Configuration store</h2>
<div class="outline-text-2" id="text-org4c7bca8">
<p>
We want:
</p>

<ul class="org-ul">
<li>to construct an application out of components dynamically driven by configuration information.</li>
<li>Provide configuration in a way that can be progressively consumed and applied</li>
<li>Allow for multiple sources of config, including files and messages.</li>
<li>Provide serialization to native types.</li>
<li>Do not tightly couple configuration and interpretation</li>
</ul>

<p>
The stream introduced above breaks that last one.  Eg configuration
frames in the stream must be ordered to match how the code tries to
apply.  In the example, depth-first ordering is required.  This is
however a natural order for eg JSON.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brett Viren</p>
<p class="date">Created: 2020-06-11 Thu 19:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
